protogia/avr-descriptionfiles-4-nim/svd/ATmega325P.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>No Description.</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSTDISBL</name>
              <description>External Reset Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>Brown-out detection at VCC=4.3 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOTRST</name>
              <description>Boot Reset vector Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTSZ</name>
              <description>Select Boot Size</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2048W_3800</name>
                  <description>Boot Flash size=2048 words Boot address=$3800</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024W_3C00</name>
                  <description>Boot Flash size=1024 words Boot address=$3C00</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512W_3E00</name>
                  <description>Boot Flash size=512 words Boot address=$3E00</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256W_3F00</name>
                  <description>Boot Flash size=256 words Boot address=$3F00</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM memory through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watchdog timer always on</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTAGEN</name>
              <description>JTAG Interface Enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCDEN</name>
              <description>On-Chip Debug Enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock Source</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_0MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_0MS</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_0MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 0 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_0MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 0 ms</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_258CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 258 CK + 4.1 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 65 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_4MS1</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 4.1 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_4MS1</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 4.1 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_4MS1</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4.1 ms</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_4MS1</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 4.1 ms</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 0 ms</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 0 ms</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 0 ms</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_258CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 258 CK + 65 ms</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 0 ms</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_65MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 65 ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_6CK_65MS</name>
                  <description>Int. RC Osc.; Start-up time: 6 CK + 65 ms</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_65MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 65 ms</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_65MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 65 ms</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 4.1 ms</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 4.1 ms</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 4.1 ms</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 0 ms</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 4.1 ms</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 65 ms</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 65 ms</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 65 ms</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 4.1 ms</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 65 ms</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTE7</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
